CSI API ETABS v1
cDCompColCSAS16_19.SetOverwrite Method
 Sets the value of a composite column design overwrite item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetOverwrite(
	string Name,
	int Item,
	double Value,
	eItemType ItemType = eItemType.Objects
)
Function SetOverwrite (
	Name As String,
	Item As Integer,
	Value As Double,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDCompColCSAS16_19
Dim Name As String
Dim Item As Integer
Dim Value As Double
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetOverwrite(Name,
	Item, Value, ItemType)
int SetOverwrite(
	String^ Name,
	int Item,
	double Value,
	eItemType ItemType = eItemType::Objects
)
abstract SetOverwrite :
        Name : string *
        Item : int *
        Value : float *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType item.
Item
Type: System.Int32
 This is an integer between 1 and 24, inclusive, indicating the overwrite item considered.
Live load reduction factor
Unbraced length ratio, Major
Unbraced length ratio, Minor
Effective length factor, K1 Major
Effective length factor, K1 Minor
Effective length factor, K2 Major
Effective length factor, K2 Minor
Moment coefficient, Omega1 Major
Moment coefficient, Omega1 Minor
Nonsway moment factor, U1 Major
Nonsway moment factor, U1 Minor
Sway moment factor, U2 Major
Sway moment factor, U2 Minor
Parameter for Compressive Resistance, n
Reduce HSS thickness
HSS welding type
Yield stress, Fy
Concrete aggregate size
Compressive capacity, Pnc
Tensile capacity, Pnt
X-axis bending capacity, Mn3
Y-axis bending capacity, Mn2
Y-axis shear capacity, Vn2
X-axis shear capacity, Vn3
Value
Type: System.Double
 The value of the considered overwrite item.
 Live load reduction factor
 Value >= 0; 0 means use program determined value.
 Unbraced length ratio, Major
 Value >= 0; 0 means use program determined value.
 Unbraced length ratio, Minor
 Value >= 0; 0 means use program determined value.
 Effective length factor, K1 Major
 Value >= 0; 0 means use program determined value.
 Effective length factor, K1 Minor
 Value >= 0; 0 means use program determined value.
 Effective length factor, K2 Major
 Value >= 0; 0 means use program determined value.
 Effective length factor, K2 Minor
 Value >= 0; 0 means use program determined value.
 Moment coefficient, Omega1 Major
 Value >= 0; 0 means use program determined value.
 Moment coefficient, Omega1 Minor
 Value >= 0; 0 means use program determined value.
 Nonsway moment factor, U1 Major
 Value >= 0; 0 means use program determined value.
 Nonsway moment factor, U1 Minor
 Value >= 0; 0 means use program determined value.
 Sway moment factor, U2 Major
 Value >= 0; 0 means use program determined value.
 Sway moment factor, U2 Minor
 Value >= 0; 0 means use program determined value.
 Parameter for Compressive Resistance, n
 Value >= 0; 0 means use program determined value.
 Reduce HSS thickness
0 = Program Default
1 = No
2 = Yes
 HSS welding type
0 = Program Default
1 = ERW
2 = SAW
 Yield stress, Fy
 Value >= 0; 0 means use program determined value. [F/L^2]
 Concrete aggregate size
 Value >= 0; 0 means use program determined value.
 Compressive capacity, Crc
 Value >= 0; 0 means use program determined value. [F]
 Tensile capacity, Tr
 Value >= 0; 0 means use program determined value. [F]
 X-axis bending capacity, Mrcx
 Value >= 0; 0 means use program determined value. [FL]
 Y-axis bending capacity, Mrxy
 Value >= 0; 0 means use program determined value. [FL]
 Y-axis shear capacity, Vry
 Value >= 0; 0 means use program determined value. [F]
 X-axis shear capacity, Vrx
 Value >= 0; 0 means use program determined value. [F]
 Demand/capacity ratio limit
 Value >= 0; 0 means use program determined value.
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignment is made to the frame object specified by the Name item.
 If this item is Group, the assignment is made to all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, the assignment is made to all selected frame objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the item is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
   Dim ProgDet As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set steel design code
   ret = SapModel.DesignCompositeColumn.SetCode("CSA S16-19")
'set overwrite item
   ret = SapModel.DesignCompositeColumn.CSAS16_19.SetOverwrite("8", 1, 7)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDCompColCSAS16_19 Interface
ETABSv1 Namespace